/*======================
---[[연산자(Operator)]]---
	- 비트 단위 연산자
=========================*/

public class Test021{
	public static void main(String[]args){
		int a = 10, b = -10;

		System.out.printf("~a : %d\n", ~a);
		System.out.printf("~b : %d\n", ~b);
	}
}

/*
~a : -11
~b : 9
계속하려면 아무 키나 누르십시오 . . .
*/

/*
a = 10 → 00001010
			 ↓ ~a
		1 1111111
		  11110101  ==> -11
		+ 00001011  → 11과 더해서 -11맞는지 확인
		-----------
		  00000000	→ 0이므로 -11이 맞다


b = -10		10 → 00001010 → 2의 보수
							 ------------
							 1의 보수 + 1
							 --------
							 비트열 반전┑
				  11110101	→ 비트열 반전
				 +       1	→ + 1
				 ---------
				  11110110 → -10 → Check!
				+ 00001010 → 10 
				------------
				  00000000 → 0이므로 -10이 확실!


				  11110110

				  00001001 → 9

*/